run/synthTopoWedge/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
(0.000000 -449.000000 50.000000) 
(449.000000 -449.000000 50.000000) 
(449.000000 0.000000 50.000000) 
(0.000000 0.000000 50.000000) 
(0.000000 -449.000000 1100.000000) 
(449.000000 -449.000000 1100.000000) 
(449.000000 0.000000 1100.000000) 
(0.000000 0.000000 1100.000000) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (12 12 27) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    atm
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }
    front
    {
        type symmetry;
        faces
        (
            (1 5 4 0)
        );
    }
    back
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
);

// ************************************************************************* //
