run/synthTopoWedge/constant/momentumTransport.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

RAS
{
    model    kEpsilon;

    turbulence      on;
    printCoeffs     on;
}

LES
{
    model    Smagorinsky;

    turbulence      on;
    printCoeffs     on;

    delta cubeRootVol;

    cubeRootVolCoeffs
    {
        deltaCoeff 1;
    }
}


// ************************************************************************* //
