run/synthTopoWedge/0/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    atm
    {
        type            pressureInletOutletVelocity;
        phi             phi.particles;
        value           uniform (0 0 0);
    }
    top
    {
        type            pressureInletOutletVelocity;
        phi             phi.particles;
        value           uniform (0 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    terrain
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
