run/synthTopoWedge/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2557
(
5000000
85586.5335058
85196.732192
84796.9828157
84422.452581
84003.1210436
83632.0967384
83262.7115696
...
)
;

boundaryField
{
    atm
    {
        type            calculated;
        value           nonuniform List<scalar> 
39
(
82803.4122159
82437.686456
82073.5761289
81711.074049
81350.1730694
80990.866091
80633.1460616
80277.0059701
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
12
(
76800.9825869
76800.9825862
76800.9825848
76800.9825827
76800.9825802
76800.9825774
76800.9825747
76800.9825721
76800.9825699
76800.9825681
76800.9825669
76800.9825663
)
;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    terrain
    {
        type            calculated;
        value           nonuniform List<scalar> 
138
(
85828.912809
85829.5657131
85829.8927684
85829.9006235
85829.9053278
85829.905424
85829.9051536
85829.9050472
...
)
;
    }
}


// ************************************************************************* //
