run/synthTopoWedge/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2557
(
86848.0068269
86843.1820612
86836.5722153
86827.9485983
86818.1501563
86805.245712
86792.0485703
86777.2750222
...
)
;

boundaryField
{
    atm
    {
        type            prghTotalHydrostaticPressure;
        value           uniform 0;
    }
    top
    {
        type            prghTotalHydrostaticPressure;
        value           uniform 0;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    terrain
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
138
(
86846.8598196
86846.8598122
86846.85927
86846.8590421
86846.8583898
86846.8582004
86846.8577346
86846.8576105
...
)
;
    }
}


// ************************************************************************* //
