run/synthTopoWedge/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2557
(
0.99757663322
0.993066885308
0.988543992714
0.983905672036
0.979559970866
0.974694436969
0.970389415351
0.966103412752
...
)
;

boundaryField
{
    atm
    {
        type            calculated;
        value           nonuniform List<scalar> 
39
(
0.96077412942
0.956530587201
0.952305788966
0.948099651339
0.943912091393
0.939743026759
0.935592375607
0.931460056588
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.889155187878;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    terrain
    {
        type            calculated;
        value           nonuniform List<scalar> 
138
(
0.996349481003
0.996349480918
0.996349474697
0.996349472082
0.996349464599
0.996349462426
0.996349457083
0.996349455659
...
)
;
    }
}


// ************************************************************************* //
