run/synthTopoWedge/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
			volScalarFieldValue alpha.gas 0.9999999999
			volScalarFieldValue alpha.particles 0.0000000001   
			volScalarFieldValue air.gas 0.99
			volScalarFieldValue H2O.gas 0.01
                        volScalarFieldValue T.gas 300.0
                        volScalarFieldValue T.particles 300.0
);

regions
(

	zoneToCell
	{
		zone "conduit";
		fieldValues
		(
			volScalarFieldValue alpha.gas 0.7
			volScalarFieldValue alpha.particles 0.3   
			volScalarFieldValue air.gas 0.000001
			volScalarFieldValue H2O.gas 0.999999
            volScalarFieldValue p 5.0e06
            volScalarFieldValue T.gas 633.0
            volScalarFieldValue T.particles 633.0
		);
	}

    
	zoneToCell
	{
		zone "crater";
		fieldValues
		(
			volScalarFieldValue alpha.gas 0.45
			volScalarFieldValue alpha.particles 0.55   
			volScalarFieldValue air.gas 0.000001
			volScalarFieldValue H2O.gas 0.999999
            volScalarFieldValue T.gas 633.0
            volScalarFieldValue T.particles 633.0
		);
	}
	
);


// ************************************************************************* //
